app/controllers/sections_controller.rb

SELECT "staffs".* FROM "staffs" WHERE ("staffs".section_id IN (1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21))
SELECT * FROM "sections" WHERE ("sections"."id" = 1)
---
  def index
    @sections = Section.find(:all, :include => :staffs, :order => "priority")

INSERT INTO "sections" ("name", "updated_at", "priority", "created_at") VALUES('ddd', '2009-02-10 03:02:57', NULL, '2009-02-10 03:02:57')
---
  def create
    @section = Section.create!(params[:section])

SELECT * FROM "sections" WHERE ("sections"."id" = 22)
DELETE FROM "sections" WHERE ("id" IN (22))
---
  def destroy
    @section = Section.find(params[:id])
    @section.delete

SELECT * FROM "sections" WHERE ("sections"."id" = 2)
UPDATE "sections" SET "updated_at" = '2009-02-10 02:24:13', "priority" = 0 WHERE "id" = 2
---
  def update
    params[:sequence].each_with_index do |id, index|
      section = Section.find(id)
      section.priority = index
      section.save