app/controllers/staffs_controller.rb

SELECT * FROM "sections" WHERE ("sections"."id" = 2)
---
  def find_section
    @section = Section.find(params[:section_id])